# Regression Bayesienne

In [2]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head(1)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.25,NaN,S,0

In [3]:
#Supprimons les colonnes moins importantes
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
#Enlevons la colonne Survived
inputs = df.drop('Survived',axis='columns')
target = df.Survived
#target

In [5]:
#Organisons la colonne sex dans un format numerique
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [98]:
#Concatenons inputs et dummies dans inputs
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(1)

   Pclass   Sex   Age  Fare  female  male
0       3  male  22.0  7.25       0     1

In [99]:
#Supprimons également la colonne female, une colonne suffit pour représenter le sex
inputs.drop(['Sex','female'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0

In [100]:
#identification de valeurs manquantes
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [101]:
inputs.Age[:15]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
Name: Age, dtype: float64

In [113]:
#Remplacons le Nan par la moyenne d Age
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(15)

    Pclass        Age     Fare  male
0        3  22.000000   7.2500     1
1        1  38.000000  71.2833     0
2        3  26.000000   7.9250     0
3        1  35.000000  53.1000     0
4        3  35.000000   8.0500     1
5        3  29.699118   8.4583     1
6        1  54.000000  51.8625     1
7        3   2.000000  21.0750     1
8        3  27.000000  11.1333     0
9        2  14.000000  30.0708     0
10       3   4.000000  16.7000     0
11       1  58.000000  26.5500     0
12       3  20.000000   8.0500     1
13       3  39.000000  31.2750     1
14       3  14.000000   7.8542     0

In [114]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

#### La taille des entrainements des x et des y

In [127]:
len(X_train)

623

In [128]:
len(y_train)

623

In [129]:
len(inputs)

891

### Type Gaussian

In [130]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [131]:
model.fit(X_train,y_train)

GaussianNB()

In [132]:
model.score(X_test,y_test)

0.7798507462686567

In [133]:
X_test[0:10]

     Pclass        Age      Fare  male
771       3  48.000000    7.8542     1
739       3  29.699118    7.8958     1
200       3  28.000000    9.5000     1
318       1  31.000000  164.8667     0
804       3  27.000000    6.9750     1
340       2   2.000000   26.0000     1
15        2  55.000000   16.0000     0
530       2   2.000000   26.0000     0
140       3  29.699118   15.2458     0
889       1  26.000000   30.0000     1

In [134]:
y_test[0:10]

771    0
739    0
200    0
318    1
804    1
340    1
15     1
530    1
140    0
889    1
Name: Survived, dtype: int64

In [135]:
model.predict(X_test[0:10])

array([0, 0, 0, 1, 0, 0, 1, 1, 1, 0], dtype=int64)

#### Modele de prediction

In [136]:
modelFinal = model.predict_proba(X_test[:10])

In [126]:
modelFinal

array([[9.70206898e-01, 2.97931021e-02],
       [9.69146376e-01, 3.08536242e-02],
       [9.68763564e-01, 3.12364357e-02],
       [6.17115957e-06, 9.99993829e-01],
       [9.67965008e-01, 3.20349924e-02],
       [8.63116454e-01, 1.36883546e-01],
       [2.72116391e-01, 7.27883609e-01],
       [1.55713571e-01, 8.44286429e-01],
       [4.82993016e-01, 5.17006984e-01],
       [7.14063733e-01, 2.85936267e-01]])